Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS504.h
#define ADTRIG8 ADTRIG8
extern volatile unsigned int  ADTRIG8 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG8BITS {
  union {
    struct {
      unsigned TRGSRC14:5;
    };
    struct {
      unsigned TRGSRC140:1;
      unsigned TRGSRC141:1;
      unsigned TRGSRC142:1;
      unsigned TRGSRC143:1;
      unsigned TRGSRC144:1;
    };
  };
} ADTRIG8BITS;
extern volatile ADTRIG8BITS ADTRIG8bits __attribute__((__sfr__));

#define ADTRIG9 ADTRIG9
extern volatile unsigned int  ADTRIG9 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG9BITS {
  union {
    struct {
      unsigned :8;
      unsigned TRGSRC17:5;
    };
    struct {
      unsigned :8;
      unsigned TRGSRC170:1;
      unsigned TRGSRC171:1;
      unsigned TRGSRC172:1;
      unsigned TRGSRC173:1;
      unsigned TRGSRC174:1;
    };
  };
} ADTRIG9BITS;
extern volatile ADTRIG9BITS ADTRIG9bits __attribute__((__sfr__));

#define ADTRIG10 ADTRIG10
extern volatile unsigned int  ADTRIG10 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG10BITS {
  union {
    struct {
      unsigned TRGSRC18:5;
      unsigned :3;
      unsigned TRGSRC19:5;
    };
    struct {
      unsigned TRGSRC180:1;
      unsigned TRGSRC181:1;
      unsigned TRGSRC182:1;
      unsigned TRGSRC183:1;
      unsigned TRGSRC184:1;
      unsigned :3;
      unsigned TRGSRC190:1;
      unsigned TRGSRC191:1;
      unsigned TRGSRC192:1;
      unsigned TRGSRC193:1;
      unsigned TRGSRC194:1;
    };
  };
} ADTRIG10BITS;
extern volatile ADTRIG10BITS ADTRIG10bits __attribute__((__sfr__));

#define ADTRIG11 ADTRIG11
extern volatile unsigned int  ADTRIG11 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG11BITS {
  union {
    struct {
      unsigned TRGSRC20:5;
      unsigned :3;
      unsigned TRGSRC21:5;
    };
    struct {
      unsigned TRGSRC200:1;
      unsigned TRGSRC201:1;
      unsigned TRGSRC202:1;
      unsigned TRGSRC203:1;
      unsigned TRGSRC204:1;
      unsigned :3;
      unsigned TRGSRC210:1;
      unsigned TRGSRC211:1;
      unsigned TRGSRC212:1;
      unsigned TRGSRC213:1;
      unsigned TRGSRC214:1;
    };
  };
} ADTRIG11BITS;
extern volatile ADTRIG11BITS ADTRIG11bits __attribute__((__sfr__));

#define ADTRIG12 ADTRIG12
extern volatile unsigned int  ADTRIG12 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG12BITS {
  union {
    struct {
      unsigned TRGSRC22:5;
      unsigned :3;
      unsigned TRGSRC23:5;
    };
    struct {
      unsigned TRGSRC220:1;
      unsigned TRGSRC221:1;
      unsigned TRGSRC222:1;
      unsigned TRGSRC223:1;
      unsigned TRGSRC224:1;
      unsigned :3;
      unsigned TRGSRC230:1;
      unsigned TRGSRC231:1;
      unsigned TRGSRC232:1;
      unsigned TRGSRC233:1;
      unsigned TRGSRC234:1;
    };
  };
} ADTRIG12BITS;
extern volatile ADTRIG12BITS ADTRIG12bits __attribute__((__sfr__));

#define ADTRIG13 ADTRIG13
extern volatile unsigned int  ADTRIG13 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG13BITS {
  union {
    struct {
      unsigned TRGSRC24:5;
      unsigned :3;
      unsigned TRGSRC25:5;
    };
    struct {
      unsigned TRGSRC240:1;
      unsigned TRGSRC241:1;
      unsigned TRGSRC242:1;
      unsigned TRGSRC243:1;
      unsigned TRGSRC244:1;
      unsigned :3;
      unsigned TRGSRC250:1;
      unsigned TRGSRC251:1;
      unsigned TRGSRC252:1;
      unsigned TRGSRC253:1;
      unsigned TRGSRC254:1;
    };
  };
} ADTRIG13BITS;
extern volatile ADTRIG13BITS ADTRIG13bits __attribute__((__sfr__));

#define ADTRIG14 ADTRIG14
extern volatile unsigned int  ADTRIG14 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG14BITS {
  union {
    struct {
      unsigned TRGSRC26:5;
    };
    struct {
      unsigned TRGSRC260:1;
      unsigned TRGSRC261:1;
      unsigned TRGSRC262:1;
      unsigned TRGSRC263:1;
      unsigned TRGSRC264:1;
    };
  };
} ADTRIG14BITS;
extern volatile ADTRIG14BITS ADTRIG14bits __attribute__((__sfr__));

#define DCMP1CON DCMP1CON
extern volatile unsigned int  DCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagDCMP1CONBITS {
  union {
    struct {
      unsigned IELOLO:1;
      unsigned IELOHI:1;
      unsigned IEHILO:1;
      unsigned IEHIHI:1;
      unsigned IEBTWN:1;
      unsigned DCMPED:1;
      unsigned DCMPGIEN:1;
      unsigned DCMPEN:1;
      unsigned AINID:5;
    };
    struct {
      unsigned :8;
      unsigned AINID0:1;
      unsigned AINID1:1;
      unsigned AINID2:1;
      unsigned AINID3:1;
      unsigned AINID4:1;
    };
  };
} DCMP1CONBITS;
extern volatile DCMP1CONBITS DCMP1CONbits __attribute__((__sfr__));

#define DCMP2CON DCMP2CON
extern volatile unsigned int  DCMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagDCMP2CONBITS {
  union {
    struct {
      unsigned IELOLO:1;
      unsigned IELOHI:1;
      unsigned IEHILO:1;
      unsigned IEHIHI:1;
      unsigned IEBTWN:1;
      unsigned DCMPED:1;
      unsigned DCMPGIEN:1;
      unsigned DCMPEN:1;
      unsigned AINID:5;
    };
    struct {
      unsigned :8;
      unsigned AINID0:1;
      unsigned AINID1:1;
      unsigned AINID2:1;
      unsigned AINID3:1;
      unsigned AINID4:1;
    };
  };
} DCMP2CONBITS;
extern volatile DCMP2CONBITS DCMP2CONbits __attribute__((__sfr__));

#define ADBASE ADBASE
extern volatile unsigned int  ADBASE __attribute__((__sfr__));
#define ADCBUF0 ADCBUF0
extern volatile unsigned int  ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile unsigned int  ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile unsigned int  ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile unsigned int  ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile unsigned int  ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile unsigned int  ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile unsigned int  ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile unsigned int  ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile unsigned int  ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile unsigned int  ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile unsigned int  ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile unsigned int  ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile unsigned int  ADCBUF12 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile unsigned int  ADCBUF14 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile unsigned int  ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile unsigned int  ADCBUF18 __attribute__((__sfr__));
#define ADCBUF19 ADCBUF19
extern volatile unsigned int  ADCBUF19 __attribute__((__sfr__));
#define ADCBUF20 ADCBUF20
extern volatile unsigned int  ADCBUF20 __attribute__((__sfr__));
#define ADCBUF21 ADCBUF21
extern volatile unsigned int  ADCBUF21 __attribute__((__sfr__));
#define ADCBUF22 ADCBUF22
extern volatile unsigned int  ADCBUF22 __attribute__((__sfr__));
#define ADCBUF23 ADCBUF23
extern volatile unsigned int  ADCBUF23 __attribute__((__sfr__));
#define ADCBUF24 ADCBUF24
extern volatile unsigned int  ADCBUF24 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile unsigned int  ADCBUF25 __attribute__((__sfr__));
#define ADCBUF26 ADCBUF26
extern volatile unsigned int  ADCBUF26 __attribute__((__sfr__));
#define ISRCCON ISRCCON
extern volatile unsigned int  ISRCCON __attribute__((__sfr__));
__extension__ typedef struct tagISRCCONBITS {
  union {
    struct {
      unsigned ISRCCAL:6;
      unsigned :2;
      unsigned OUTSEL:3;
      unsigned :4;
      unsigned ISRCEN:1;
    };
    struct {
      unsigned ISRCCAL0:1;
      unsigned ISRCCAL1:1;
      unsigned ISRCCAL2:1;
      unsigned ISRCCAL3:1;
      unsigned ISRCCAL4:1;
      unsigned ISRCCAL5:1;
      unsigned :2;
      unsigned OUTSEL0:1;
      unsigned OUTSEL1:1;
      unsigned OUTSEL2:1;
    };
  };
} ISRCCONBITS;
extern volatile ISRCCONBITS ISRCCONbits __attribute__((__sfr__));

#define PGA1CON PGA1CON
extern volatile unsigned int  PGA1CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA1CONBITS {
  union {
    struct {
      unsigned GAIN:3;
      unsigned :5;
      unsigned SELNI:3;
      unsigned SELPI:3;
      unsigned PGAOEN:1;
      unsigned PGAEN:1;
    };
    struct {
      unsigned GAIN0:1;
      unsigned GAIN1:1;
      unsigned GAIN2:1;
      unsigned :5;
      unsigned SELNI0:1;
      unsigned SELNI1:1;
      unsigned SELNI2:1;
      unsigned SELPI0:1;
      unsigned SELPI1:1;
      unsigned SELPI2:1;
    };
  };
} PGA1CONBITS;
extern volatile PGA1CONBITS PGA1CONbits __attribute__((__sfr__));

#define PGA1CAL PGA1CAL
extern volatile unsigned int  PGA1CAL __attribute__((__sfr__));
typedef struct tagPGA1CALBITS {
  unsigned PGACAL:6;
} PGA1CALBITS;
extern volatile PGA1CALBITS PGA1CALbits __attribute__((__sfr__));

