Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS504.h
#define _SPI2CON1_SPRE1_POSITION                 0x00000003
#define _SPI2CON1_SPRE1_MASK                     0x00000008
#define _SPI2CON1_SPRE1_LENGTH                   0x00000001

#define _SPI2CON1_SPRE2_POSITION                 0x00000004
#define _SPI2CON1_SPRE2_MASK                     0x00000010
#define _SPI2CON1_SPRE2_LENGTH                   0x00000001

#define _SPI2CON2_SPIBEN_POSITION                0x00000000
#define _SPI2CON2_SPIBEN_MASK                    0x00000001
#define _SPI2CON2_SPIBEN_LENGTH                  0x00000001

#define _SPI2CON2_FRMDLY_POSITION                0x00000001
#define _SPI2CON2_FRMDLY_MASK                    0x00000002
#define _SPI2CON2_FRMDLY_LENGTH                  0x00000001

#define _SPI2CON2_FRMPOL_POSITION                0x0000000D
#define _SPI2CON2_FRMPOL_MASK                    0x00002000
#define _SPI2CON2_FRMPOL_LENGTH                  0x00000001

#define _SPI2CON2_SPIFSD_POSITION                0x0000000E
#define _SPI2CON2_SPIFSD_MASK                    0x00004000
#define _SPI2CON2_SPIFSD_LENGTH                  0x00000001

#define _SPI2CON2_FRMEN_POSITION                 0x0000000F
#define _SPI2CON2_FRMEN_MASK                     0x00008000
#define _SPI2CON2_FRMEN_LENGTH                   0x00000001

#define _ADCON1_FORM_POSITION                    0x0000000B
#define _ADCON1_FORM_MASK                        0x00000800
#define _ADCON1_FORM_LENGTH                      0x00000001

#define _ADCON1_ADSIDL_POSITION                  0x0000000D
#define _ADCON1_ADSIDL_MASK                      0x00002000
#define _ADCON1_ADSIDL_LENGTH                    0x00000001

#define _ADCON1_ADON_POSITION                    0x0000000F
#define _ADCON1_ADON_MASK                        0x00008000
#define _ADCON1_ADON_LENGTH                      0x00000001

#define _ADCON2_EIE_POSITION                     0x00000000
#define _ADCON2_EIE_MASK                         0x00000007
#define _ADCON2_EIE_LENGTH                       0x00000003

#define _ADCON2_STRGSRC_POSITION                 0x00000006
#define _ADCON2_STRGSRC_MASK                     0x000007C0
#define _ADCON2_STRGSRC_LENGTH                   0x00000005

#define _ADCON2_FLTRDLY_POSITION                 0x0000000B
#define _ADCON2_FLTRDLY_MASK                     0x0000F800
#define _ADCON2_FLTRDLY_LENGTH                   0x00000005

#define _ADCON2_EIE0_POSITION                    0x00000000
#define _ADCON2_EIE0_MASK                        0x00000001
#define _ADCON2_EIE0_LENGTH                      0x00000001

#define _ADCON2_EIE1_POSITION                    0x00000001
#define _ADCON2_EIE1_MASK                        0x00000002
#define _ADCON2_EIE1_LENGTH                      0x00000001

#define _ADCON2_EIE2_POSITION                    0x00000002
#define _ADCON2_EIE2_MASK                        0x00000004
#define _ADCON2_EIE2_LENGTH                      0x00000001

#define _ADCON2_STRGSRC0_POSITION                0x00000006
#define _ADCON2_STRGSRC0_MASK                    0x00000040
#define _ADCON2_STRGSRC0_LENGTH                  0x00000001

#define _ADCON2_STRGSRC1_POSITION                0x00000007
#define _ADCON2_STRGSRC1_MASK                    0x00000080
#define _ADCON2_STRGSRC1_LENGTH                  0x00000001

#define _ADCON2_STRGSRC2_POSITION                0x00000008
#define _ADCON2_STRGSRC2_MASK                    0x00000100
#define _ADCON2_STRGSRC2_LENGTH                  0x00000001

#define _ADCON2_STRGSRC3_POSITION                0x00000009
#define _ADCON2_STRGSRC3_MASK                    0x00000200
#define _ADCON2_STRGSRC3_LENGTH                  0x00000001

#define _ADCON2_STRGSRC4_POSITION                0x0000000A
#define _ADCON2_STRGSRC4_MASK                    0x00000400
#define _ADCON2_STRGSRC4_LENGTH                  0x00000001

#define _ADCON2_FLTRDLY0_POSITION                0x0000000B
#define _ADCON2_FLTRDLY0_MASK                    0x00000800
#define _ADCON2_FLTRDLY0_LENGTH                  0x00000001

#define _ADCON2_FLTRDLY1_POSITION                0x0000000C
#define _ADCON2_FLTRDLY1_MASK                    0x00001000
#define _ADCON2_FLTRDLY1_LENGTH                  0x00000001

#define _ADCON2_FLTRDLY2_POSITION                0x0000000D
#define _ADCON2_FLTRDLY2_MASK                    0x00002000
#define _ADCON2_FLTRDLY2_LENGTH                  0x00000001

#define _ADCON2_FLTRDLY3_POSITION                0x0000000E
#define _ADCON2_FLTRDLY3_MASK                    0x00004000
#define _ADCON2_FLTRDLY3_LENGTH                  0x00000001

#define _ADCON2_FLTRDLY4_POSITION                0x0000000F
#define _ADCON2_FLTRDLY4_MASK                    0x00008000
#define _ADCON2_FLTRDLY4_LENGTH                  0x00000001

#define _ADCON3_ADCS_POSITION                    0x00000000
#define _ADCON3_ADCS_MASK                        0x0000007F
#define _ADCON3_ADCS_LENGTH                      0x00000007

#define _ADCON3_ADCSEL_POSITION                  0x00000008
#define _ADCON3_ADCSEL_MASK                      0x00000300
#define _ADCON3_ADCSEL_LENGTH                    0x00000002

#define _ADCON3_LOWPWR_POSITION                  0x0000000D
#define _ADCON3_LOWPWR_MASK                      0x00002000
#define _ADCON3_LOWPWR_LENGTH                    0x00000001

#define _ADCON3_BOOST_POSITION                   0x0000000E
#define _ADCON3_BOOST_MASK                       0x00004000
#define _ADCON3_BOOST_LENGTH                     0x00000001

#define _ADCON3_ADCS0_POSITION                   0x00000000
#define _ADCON3_ADCS0_MASK                       0x00000001
#define _ADCON3_ADCS0_LENGTH                     0x00000001

#define _ADCON3_ADCS1_POSITION                   0x00000001
#define _ADCON3_ADCS1_MASK                       0x00000002
#define _ADCON3_ADCS1_LENGTH                     0x00000001

#define _ADCON3_ADCS2_POSITION                   0x00000002
#define _ADCON3_ADCS2_MASK                       0x00000004
#define _ADCON3_ADCS2_LENGTH                     0x00000001

#define _ADCON3_ADCS3_POSITION                   0x00000003
#define _ADCON3_ADCS3_MASK                       0x00000008
#define _ADCON3_ADCS3_LENGTH                     0x00000001

#define _ADCON3_ADCS4_POSITION                   0x00000004
#define _ADCON3_ADCS4_MASK                       0x00000010
#define _ADCON3_ADCS4_LENGTH                     0x00000001

#define _ADCON3_ADCS5_POSITION                   0x00000005
#define _ADCON3_ADCS5_MASK                       0x00000020
#define _ADCON3_ADCS5_LENGTH                     0x00000001

#define _ADCON3_ADCS6_POSITION                   0x00000006
#define _ADCON3_ADCS6_MASK                       0x00000040
#define _ADCON3_ADCS6_LENGTH                     0x00000001

#define _ADCON3_ADCSEL0_POSITION                 0x00000008
#define _ADCON3_ADCSEL0_MASK                     0x00000100
#define _ADCON3_ADCSEL0_LENGTH                   0x00000001

#define _ADCON3_ADCSEL1_POSITION                 0x00000009
#define _ADCON3_ADCSEL1_MASK                     0x00000200
#define _ADCON3_ADCSEL1_LENGTH                   0x00000001

#define _ADCON4_SAMC_POSITION                    0x00000000
#define _ADCON4_SAMC_MASK                        0x000000FF
#define _ADCON4_SAMC_LENGTH                      0x00000008

