Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS504.h
#define _ADTRIG2_TRGSRC32_POSITION               0x0000000A
#define _ADTRIG2_TRGSRC32_MASK                   0x00000400
#define _ADTRIG2_TRGSRC32_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC33_POSITION               0x0000000B
#define _ADTRIG2_TRGSRC33_MASK                   0x00000800
#define _ADTRIG2_TRGSRC33_LENGTH                 0x00000001

#define _ADTRIG2_TRGSRC34_POSITION               0x0000000C
#define _ADTRIG2_TRGSRC34_MASK                   0x00001000
#define _ADTRIG2_TRGSRC34_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC4_POSITION                0x00000000
#define _ADTRIG3_TRGSRC4_MASK                    0x0000001F
#define _ADTRIG3_TRGSRC4_LENGTH                  0x00000005

#define _ADTRIG3_TRGSRC5_POSITION                0x00000008
#define _ADTRIG3_TRGSRC5_MASK                    0x00001F00
#define _ADTRIG3_TRGSRC5_LENGTH                  0x00000005

#define _ADTRIG3_TRGSRC40_POSITION               0x00000000
#define _ADTRIG3_TRGSRC40_MASK                   0x00000001
#define _ADTRIG3_TRGSRC40_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC41_POSITION               0x00000001
#define _ADTRIG3_TRGSRC41_MASK                   0x00000002
#define _ADTRIG3_TRGSRC41_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC42_POSITION               0x00000002
#define _ADTRIG3_TRGSRC42_MASK                   0x00000004
#define _ADTRIG3_TRGSRC42_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC43_POSITION               0x00000003
#define _ADTRIG3_TRGSRC43_MASK                   0x00000008
#define _ADTRIG3_TRGSRC43_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC44_POSITION               0x00000004
#define _ADTRIG3_TRGSRC44_MASK                   0x00000010
#define _ADTRIG3_TRGSRC44_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC50_POSITION               0x00000008
#define _ADTRIG3_TRGSRC50_MASK                   0x00000100
#define _ADTRIG3_TRGSRC50_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC51_POSITION               0x00000009
#define _ADTRIG3_TRGSRC51_MASK                   0x00000200
#define _ADTRIG3_TRGSRC51_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC52_POSITION               0x0000000A
#define _ADTRIG3_TRGSRC52_MASK                   0x00000400
#define _ADTRIG3_TRGSRC52_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC53_POSITION               0x0000000B
#define _ADTRIG3_TRGSRC53_MASK                   0x00000800
#define _ADTRIG3_TRGSRC53_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC54_POSITION               0x0000000C
#define _ADTRIG3_TRGSRC54_MASK                   0x00001000
#define _ADTRIG3_TRGSRC54_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC6_POSITION                0x00000000
#define _ADTRIG4_TRGSRC6_MASK                    0x0000001F
#define _ADTRIG4_TRGSRC6_LENGTH                  0x00000005

#define _ADTRIG4_TRGSRC7_POSITION                0x00000008
#define _ADTRIG4_TRGSRC7_MASK                    0x00001F00
#define _ADTRIG4_TRGSRC7_LENGTH                  0x00000005

#define _ADTRIG4_TRGSRC60_POSITION               0x00000000
#define _ADTRIG4_TRGSRC60_MASK                   0x00000001
#define _ADTRIG4_TRGSRC60_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC61_POSITION               0x00000001
#define _ADTRIG4_TRGSRC61_MASK                   0x00000002
#define _ADTRIG4_TRGSRC61_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC62_POSITION               0x00000002
#define _ADTRIG4_TRGSRC62_MASK                   0x00000004
#define _ADTRIG4_TRGSRC62_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC63_POSITION               0x00000003
#define _ADTRIG4_TRGSRC63_MASK                   0x00000008
#define _ADTRIG4_TRGSRC63_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC64_POSITION               0x00000004
#define _ADTRIG4_TRGSRC64_MASK                   0x00000010
#define _ADTRIG4_TRGSRC64_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC70_POSITION               0x00000008
#define _ADTRIG4_TRGSRC70_MASK                   0x00000100
#define _ADTRIG4_TRGSRC70_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC71_POSITION               0x00000009
#define _ADTRIG4_TRGSRC71_MASK                   0x00000200
#define _ADTRIG4_TRGSRC71_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC72_POSITION               0x0000000A
#define _ADTRIG4_TRGSRC72_MASK                   0x00000400
#define _ADTRIG4_TRGSRC72_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC73_POSITION               0x0000000B
#define _ADTRIG4_TRGSRC73_MASK                   0x00000800
#define _ADTRIG4_TRGSRC73_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC74_POSITION               0x0000000C
#define _ADTRIG4_TRGSRC74_MASK                   0x00001000
#define _ADTRIG4_TRGSRC74_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC8_POSITION                0x00000000
#define _ADTRIG5_TRGSRC8_MASK                    0x0000001F
#define _ADTRIG5_TRGSRC8_LENGTH                  0x00000005

#define _ADTRIG5_TRGSRC9_POSITION                0x00000008
#define _ADTRIG5_TRGSRC9_MASK                    0x00001F00
#define _ADTRIG5_TRGSRC9_LENGTH                  0x00000005

#define _ADTRIG5_TRGSRC80_POSITION               0x00000000
#define _ADTRIG5_TRGSRC80_MASK                   0x00000001
#define _ADTRIG5_TRGSRC80_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC81_POSITION               0x00000001
#define _ADTRIG5_TRGSRC81_MASK                   0x00000002
#define _ADTRIG5_TRGSRC81_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC82_POSITION               0x00000002
#define _ADTRIG5_TRGSRC82_MASK                   0x00000004
#define _ADTRIG5_TRGSRC82_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC83_POSITION               0x00000003
#define _ADTRIG5_TRGSRC83_MASK                   0x00000008
#define _ADTRIG5_TRGSRC83_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC84_POSITION               0x00000004
#define _ADTRIG5_TRGSRC84_MASK                   0x00000010
#define _ADTRIG5_TRGSRC84_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC90_POSITION               0x00000008
#define _ADTRIG5_TRGSRC90_MASK                   0x00000100
#define _ADTRIG5_TRGSRC90_LENGTH                 0x00000001

