Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS504.h
#define _FCLCON5_CLSRC2_POSITION                 0x0000000C
#define _FCLCON5_CLSRC2_MASK                     0x00001000
#define _FCLCON5_CLSRC2_LENGTH                   0x00000001

#define _FCLCON5_CLSRC3_POSITION                 0x0000000D
#define _FCLCON5_CLSRC3_MASK                     0x00002000
#define _FCLCON5_CLSRC3_LENGTH                   0x00000001

#define _FCLCON5_CLSRC4_POSITION                 0x0000000E
#define _FCLCON5_CLSRC4_MASK                     0x00004000
#define _FCLCON5_CLSRC4_LENGTH                   0x00000001

#define _TRIG5_TRGCMP_POSITION                   0x00000003
#define _TRIG5_TRGCMP_MASK                       0x0000FFF8
#define _TRIG5_TRGCMP_LENGTH                     0x0000000D

#define _TRIG5_TRGCMP0_POSITION                  0x00000003
#define _TRIG5_TRGCMP0_MASK                      0x00000008
#define _TRIG5_TRGCMP0_LENGTH                    0x00000001

#define _TRIG5_TRGCMP1_POSITION                  0x00000004
#define _TRIG5_TRGCMP1_MASK                      0x00000010
#define _TRIG5_TRGCMP1_LENGTH                    0x00000001

#define _TRIG5_TRGCMP2_POSITION                  0x00000005
#define _TRIG5_TRGCMP2_MASK                      0x00000020
#define _TRIG5_TRGCMP2_LENGTH                    0x00000001

#define _TRIG5_TRGCMP3_POSITION                  0x00000006
#define _TRIG5_TRGCMP3_MASK                      0x00000040
#define _TRIG5_TRGCMP3_LENGTH                    0x00000001

#define _TRIG5_TRGCMP4_POSITION                  0x00000007
#define _TRIG5_TRGCMP4_MASK                      0x00000080
#define _TRIG5_TRGCMP4_LENGTH                    0x00000001

#define _TRIG5_TRGCMP5_POSITION                  0x00000008
#define _TRIG5_TRGCMP5_MASK                      0x00000100
#define _TRIG5_TRGCMP5_LENGTH                    0x00000001

#define _TRIG5_TRGCMP6_POSITION                  0x00000009
#define _TRIG5_TRGCMP6_MASK                      0x00000200
#define _TRIG5_TRGCMP6_LENGTH                    0x00000001

#define _TRIG5_TRGCMP7_POSITION                  0x0000000A
#define _TRIG5_TRGCMP7_MASK                      0x00000400
#define _TRIG5_TRGCMP7_LENGTH                    0x00000001

#define _TRIG5_TRGCMP8_POSITION                  0x0000000B
#define _TRIG5_TRGCMP8_MASK                      0x00000800
#define _TRIG5_TRGCMP8_LENGTH                    0x00000001

#define _TRIG5_TRGCMP9_POSITION                  0x0000000C
#define _TRIG5_TRGCMP9_MASK                      0x00001000
#define _TRIG5_TRGCMP9_LENGTH                    0x00000001

#define _TRIG5_TRGCMP10_POSITION                 0x0000000D
#define _TRIG5_TRGCMP10_MASK                     0x00002000
#define _TRIG5_TRGCMP10_LENGTH                   0x00000001

#define _TRIG5_TRGCMP11_POSITION                 0x0000000E
#define _TRIG5_TRGCMP11_MASK                     0x00004000
#define _TRIG5_TRGCMP11_LENGTH                   0x00000001

#define _TRIG5_TRGCMP12_POSITION                 0x0000000F
#define _TRIG5_TRGCMP12_MASK                     0x00008000
#define _TRIG5_TRGCMP12_LENGTH                   0x00000001

#define _TRGCON5_TRGSTRT_POSITION                0x00000000
#define _TRGCON5_TRGSTRT_MASK                    0x0000003F
#define _TRGCON5_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON5_DTM_POSITION                    0x00000007
#define _TRGCON5_DTM_MASK                        0x00000080
#define _TRGCON5_DTM_LENGTH                      0x00000001

#define _TRGCON5_TRGDIV_POSITION                 0x0000000C
#define _TRGCON5_TRGDIV_MASK                     0x0000F000
#define _TRGCON5_TRGDIV_LENGTH                   0x00000004

#define _TRGCON5_TRGSTRT0_POSITION               0x00000000
#define _TRGCON5_TRGSTRT0_MASK                   0x00000001
#define _TRGCON5_TRGSTRT0_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT1_POSITION               0x00000001
#define _TRGCON5_TRGSTRT1_MASK                   0x00000002
#define _TRGCON5_TRGSTRT1_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT2_POSITION               0x00000002
#define _TRGCON5_TRGSTRT2_MASK                   0x00000004
#define _TRGCON5_TRGSTRT2_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT3_POSITION               0x00000003
#define _TRGCON5_TRGSTRT3_MASK                   0x00000008
#define _TRGCON5_TRGSTRT3_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT4_POSITION               0x00000004
#define _TRGCON5_TRGSTRT4_MASK                   0x00000010
#define _TRGCON5_TRGSTRT4_LENGTH                 0x00000001

#define _TRGCON5_TRGSTRT5_POSITION               0x00000005
#define _TRGCON5_TRGSTRT5_MASK                   0x00000020
#define _TRGCON5_TRGSTRT5_LENGTH                 0x00000001

#define _TRGCON5_TRGDIV0_POSITION                0x0000000C
#define _TRGCON5_TRGDIV0_MASK                    0x00001000
#define _TRGCON5_TRGDIV0_LENGTH                  0x00000001

#define _TRGCON5_TRGDIV1_POSITION                0x0000000D
#define _TRGCON5_TRGDIV1_MASK                    0x00002000
#define _TRGCON5_TRGDIV1_LENGTH                  0x00000001

#define _TRGCON5_TRGDIV2_POSITION                0x0000000E
#define _TRGCON5_TRGDIV2_MASK                    0x00004000
#define _TRGCON5_TRGDIV2_LENGTH                  0x00000001

#define _TRGCON5_TRGDIV3_POSITION                0x0000000F
#define _TRGCON5_TRGDIV3_MASK                    0x00008000
#define _TRGCON5_TRGDIV3_LENGTH                  0x00000001

#define _STRIG5_STRGCMP_POSITION                 0x00000003
#define _STRIG5_STRGCMP_MASK                     0x0000FFF8
#define _STRIG5_STRGCMP_LENGTH                   0x0000000D

#define _STRIG5_STRGCMP0_POSITION                0x00000003
#define _STRIG5_STRGCMP0_MASK                    0x00000008
#define _STRIG5_STRGCMP0_LENGTH                  0x00000001

#define _STRIG5_STRGCMP1_POSITION                0x00000004
#define _STRIG5_STRGCMP1_MASK                    0x00000010
#define _STRIG5_STRGCMP1_LENGTH                  0x00000001

#define _STRIG5_STRGCMP2_POSITION                0x00000005
#define _STRIG5_STRGCMP2_MASK                    0x00000020
#define _STRIG5_STRGCMP2_LENGTH                  0x00000001

#define _STRIG5_STRGCMP3_POSITION                0x00000006
#define _STRIG5_STRGCMP3_MASK                    0x00000040
#define _STRIG5_STRGCMP3_LENGTH                  0x00000001

