Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS504.h
/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __FBOOT_BASE 0x801000
#define __FBOOT_LENGTH 0x2


/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xad80

#define __FSEC_BASE 0xaf80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xaf90
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0xaf94
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0xaf98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xaf9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xafa0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xafa4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xafa8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0xafac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0xafb0
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0xaffc
#define __FBTSEQ_LENGTH 0x2

#endif


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x5580

#define __FSEC_BASE 0x5780
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x5790
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x5794
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x5798
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x579c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x57a0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x57a4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x57a8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0x57ac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x57b0
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0x57fc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000


#endif
